grevaillot/svd_tools/headers/ATSAM3X8H/tc0.h
#pragma once 

/* --- TC0: Timer Counter 0 ----------------------------------------- */

/** @defgroup tc0_registers Timer Counter 0 Register
@{*/

/** TC0_CCR0 Channel Control Register (channel = 0) **/
#define TC0_CCR0			MMIO32(TC0_BASE + 0x00)
/** TC0_CMR0 Channel Mode Register (channel = 0) **/
#define TC0_CMR0			MMIO32(TC0_BASE + 0x04)
/** TC0_CMR0_WAVE_EQ_1 Channel Mode Register (channel = 0) **/
#define TC0_CMR0_WAVE_EQ_1			MMIO32(TC0_BASE + 0x04)
/** TC0_SMMR0 Stepper Motor Mode Register (channel = 0) **/
#define TC0_SMMR0			MMIO32(TC0_BASE + 0x08)
/** TC0_CV0 Counter Value (channel = 0) **/
#define TC0_CV0			MMIO32(TC0_BASE + 0x10)
/** TC0_RA0 Register A (channel = 0) **/
#define TC0_RA0			MMIO32(TC0_BASE + 0x14)
/** TC0_RB0 Register B (channel = 0) **/
#define TC0_RB0			MMIO32(TC0_BASE + 0x18)
/** TC0_RC0 Register C (channel = 0) **/
#define TC0_RC0			MMIO32(TC0_BASE + 0x1c)
/** TC0_SR0 Status Register (channel = 0) **/
#define TC0_SR0			MMIO32(TC0_BASE + 0x20)
/** TC0_IER0 Interrupt Enable Register (channel = 0) **/
#define TC0_IER0			MMIO32(TC0_BASE + 0x24)
/** TC0_IDR0 Interrupt Disable Register (channel = 0) **/
#define TC0_IDR0			MMIO32(TC0_BASE + 0x28)
/** TC0_IMR0 Interrupt Mask Register (channel = 0) **/
#define TC0_IMR0			MMIO32(TC0_BASE + 0x2c)
/** TC0_CCR1 Channel Control Register (channel = 1) **/
#define TC0_CCR1			MMIO32(TC0_BASE + 0x40)
/** TC0_CMR1 Channel Mode Register (channel = 1) **/
#define TC0_CMR1			MMIO32(TC0_BASE + 0x44)
/** TC0_CMR1_WAVE_EQ_1 Channel Mode Register (channel = 1) **/
#define TC0_CMR1_WAVE_EQ_1			MMIO32(TC0_BASE + 0x44)
/** TC0_SMMR1 Stepper Motor Mode Register (channel = 1) **/
#define TC0_SMMR1			MMIO32(TC0_BASE + 0x48)
/** TC0_CV1 Counter Value (channel = 1) **/
#define TC0_CV1			MMIO32(TC0_BASE + 0x50)
/** TC0_RA1 Register A (channel = 1) **/
#define TC0_RA1			MMIO32(TC0_BASE + 0x54)
/** TC0_RB1 Register B (channel = 1) **/
#define TC0_RB1			MMIO32(TC0_BASE + 0x58)
/** TC0_RC1 Register C (channel = 1) **/
#define TC0_RC1			MMIO32(TC0_BASE + 0x5c)
/** TC0_SR1 Status Register (channel = 1) **/
#define TC0_SR1			MMIO32(TC0_BASE + 0x60)
/** TC0_IER1 Interrupt Enable Register (channel = 1) **/
#define TC0_IER1			MMIO32(TC0_BASE + 0x64)
/** TC0_IDR1 Interrupt Disable Register (channel = 1) **/
#define TC0_IDR1			MMIO32(TC0_BASE + 0x68)
/** TC0_IMR1 Interrupt Mask Register (channel = 1) **/
#define TC0_IMR1			MMIO32(TC0_BASE + 0x6c)
/** TC0_CCR2 Channel Control Register (channel = 2) **/
#define TC0_CCR2			MMIO32(TC0_BASE + 0x80)
/** TC0_CMR2 Channel Mode Register (channel = 2) **/
#define TC0_CMR2			MMIO32(TC0_BASE + 0x84)
/** TC0_CMR2_WAVE_EQ_1 Channel Mode Register (channel = 2) **/
#define TC0_CMR2_WAVE_EQ_1			MMIO32(TC0_BASE + 0x84)
/** TC0_SMMR2 Stepper Motor Mode Register (channel = 2) **/
#define TC0_SMMR2			MMIO32(TC0_BASE + 0x88)
/** TC0_CV2 Counter Value (channel = 2) **/
#define TC0_CV2			MMIO32(TC0_BASE + 0x90)
/** TC0_RA2 Register A (channel = 2) **/
#define TC0_RA2			MMIO32(TC0_BASE + 0x94)
/** TC0_RB2 Register B (channel = 2) **/
#define TC0_RB2			MMIO32(TC0_BASE + 0x98)
/** TC0_RC2 Register C (channel = 2) **/
#define TC0_RC2			MMIO32(TC0_BASE + 0x9c)
/** TC0_SR2 Status Register (channel = 2) **/
#define TC0_SR2			MMIO32(TC0_BASE + 0xa0)
/** TC0_IER2 Interrupt Enable Register (channel = 2) **/
#define TC0_IER2			MMIO32(TC0_BASE + 0xa4)
/** TC0_IDR2 Interrupt Disable Register (channel = 2) **/
#define TC0_IDR2			MMIO32(TC0_BASE + 0xa8)
/** TC0_IMR2 Interrupt Mask Register (channel = 2) **/
#define TC0_IMR2			MMIO32(TC0_BASE + 0xac)
/** TC0_BCR Block Control Register **/
#define TC0_BCR			MMIO32(TC0_BASE + 0xc0)
/** TC0_BMR Block Mode Register **/
#define TC0_BMR			MMIO32(TC0_BASE + 0xc4)
/** TC0_QIER QDEC Interrupt Enable Register **/
#define TC0_QIER			MMIO32(TC0_BASE + 0xc8)
/** TC0_QIDR QDEC Interrupt Disable Register **/
#define TC0_QIDR			MMIO32(TC0_BASE + 0xcc)
/** TC0_QIMR QDEC Interrupt Mask Register **/
#define TC0_QIMR			MMIO32(TC0_BASE + 0xd0)
/** TC0_QISR QDEC Interrupt Status Register **/
#define TC0_QISR			MMIO32(TC0_BASE + 0xd4)
/** TC0_FMR Fault Mode Register **/
#define TC0_FMR			MMIO32(TC0_BASE + 0xd8)
/** TC0_WPMR Write Protect Mode Register **/
#define TC0_WPMR			MMIO32(TC0_BASE + 0xe4)

/**@}*/


/** @defgroup tc0_ccr0 CCR0 Channel Control Register (channel = 0)
@{*/

/** TC0_CCR0_SWTRG Software Trigger Command **/
#define TC0_CCR0_SWTRG		(1 << 2)
/** TC0_CCR0_CLKDIS Counter Clock Disable Command **/
#define TC0_CCR0_CLKDIS		(1 << 1)
/** TC0_CCR0_CLKEN Counter Clock Enable Command **/
#define TC0_CCR0_CLKEN		(1 << 0)

/**@}*/

/** @defgroup tc0_cmr0 CMR0 Channel Mode Register (channel = 0)
@{*/


#define TC0_CMR0_LDRB_SHIFT		18
#define TC0_CMR0_LDRB_MASK		0x03
/** @defgroup tc0_cmr0_ldrb LDRB RB Loading Edge Selection
@{*/
/**@}*/


#define TC0_CMR0_LDRA_SHIFT		16
#define TC0_CMR0_LDRA_MASK		0x03
/** @defgroup tc0_cmr0_ldra LDRA RA Loading Edge Selection
@{*/
/**@}*/

/** TC0_CMR0_WAVE Waveform Mode **/
#define TC0_CMR0_WAVE		(1 << 15)
/** TC0_CMR0_CPCTRG RC Compare Trigger Enable **/
#define TC0_CMR0_CPCTRG		(1 << 14)
/** TC0_CMR0_ABETRG TIOA or TIOB External Trigger Selection **/
#define TC0_CMR0_ABETRG		(1 << 10)

#define TC0_CMR0_ETRGEDG_SHIFT		8
#define TC0_CMR0_ETRGEDG_MASK		0x03
/** @defgroup tc0_cmr0_etrgedg ETRGEDG External Trigger Edge Selection
@{*/
/**@}*/

/** TC0_CMR0_LDBDIS Counter Clock Disable with RB Loading **/
#define TC0_CMR0_LDBDIS		(1 << 7)
/** TC0_CMR0_LDBSTOP Counter Clock Stopped with RB Loading **/
#define TC0_CMR0_LDBSTOP		(1 << 6)

#define TC0_CMR0_BURST_SHIFT		4
#define TC0_CMR0_BURST_MASK		0x03
/** @defgroup tc0_cmr0_burst BURST Burst Signal Selection
@{*/
/**@}*/

/** TC0_CMR0_CLKI Clock Invert **/
#define TC0_CMR0_CLKI		(1 << 3)

#define TC0_CMR0_TCCLKS_SHIFT		0
#define TC0_CMR0_TCCLKS_MASK		0x07
/** @defgroup tc0_cmr0_tcclks TCCLKS Clock Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_cmr0_wave_eq_1 CMR0WAVEEQ1 Channel Mode Register (channel = 0)
@{*/


#define TC0_CMR0_WAVE_EQ_1_BSWTRG_SHIFT		30
#define TC0_CMR0_WAVE_EQ_1_BSWTRG_MASK		0x03
/** @defgroup tc0_cmr0_wave_eq_1_bswtrg BSWTRG Software Trigger Effect on TIOB
@{*/
/**@}*/


#define TC0_CMR0_WAVE_EQ_1_BEEVT_SHIFT		28
#define TC0_CMR0_WAVE_EQ_1_BEEVT_MASK		0x03
/** @defgroup tc0_cmr0_wave_eq_1_beevt BEEVT External Event Effect on TIOB
@{*/
/**@}*/


#define TC0_CMR0_WAVE_EQ_1_BCPC_SHIFT		26
#define TC0_CMR0_WAVE_EQ_1_BCPC_MASK		0x03
/** @defgroup tc0_cmr0_wave_eq_1_bcpc BCPC RC Compare Effect on TIOB
@{*/
/**@}*/


#define TC0_CMR0_WAVE_EQ_1_BCPB_SHIFT		24
#define TC0_CMR0_WAVE_EQ_1_BCPB_MASK		0x03
/** @defgroup tc0_cmr0_wave_eq_1_bcpb BCPB RB Compare Effect on TIOB
@{*/
/**@}*/


#define TC0_CMR0_WAVE_EQ_1_ASWTRG_SHIFT		22
#define TC0_CMR0_WAVE_EQ_1_ASWTRG_MASK		0x03
/** @defgroup tc0_cmr0_wave_eq_1_aswtrg ASWTRG Software Trigger Effect on TIOA
@{*/
/**@}*/


#define TC0_CMR0_WAVE_EQ_1_AEEVT_SHIFT		20
#define TC0_CMR0_WAVE_EQ_1_AEEVT_MASK		0x03
/** @defgroup tc0_cmr0_wave_eq_1_aeevt AEEVT External Event Effect on TIOA
@{*/
/**@}*/


#define TC0_CMR0_WAVE_EQ_1_ACPC_SHIFT		18
#define TC0_CMR0_WAVE_EQ_1_ACPC_MASK		0x03
/** @defgroup tc0_cmr0_wave_eq_1_acpc ACPC RC Compare Effect on TIOA
@{*/
/**@}*/


#define TC0_CMR0_WAVE_EQ_1_ACPA_SHIFT		16
#define TC0_CMR0_WAVE_EQ_1_ACPA_MASK		0x03
/** @defgroup tc0_cmr0_wave_eq_1_acpa ACPA RA Compare Effect on TIOA
@{*/
/**@}*/

/** TC0_CMR0_WAVE_EQ_1_WAVE Waveform Mode **/
#define TC0_CMR0_WAVE_EQ_1_WAVE		(1 << 15)

#define TC0_CMR0_WAVE_EQ_1_WAVSEL_SHIFT		13
#define TC0_CMR0_WAVE_EQ_1_WAVSEL_MASK		0x03
/** @defgroup tc0_cmr0_wave_eq_1_wavsel WAVSEL Waveform Selection
@{*/
/**@}*/

/** TC0_CMR0_WAVE_EQ_1_ENETRG External Event Trigger Enable **/
#define TC0_CMR0_WAVE_EQ_1_ENETRG		(1 << 12)

#define TC0_CMR0_WAVE_EQ_1_EEVT_SHIFT		10
#define TC0_CMR0_WAVE_EQ_1_EEVT_MASK		0x03
/** @defgroup tc0_cmr0_wave_eq_1_eevt EEVT External Event Selection
@{*/
/**@}*/


