grevaillot/svd_tools/headers/ATSAM3X8H/tc0.h
#define TC0_CMR0_WAVE_EQ_1_EEVTEDG_SHIFT		8
#define TC0_CMR0_WAVE_EQ_1_EEVTEDG_MASK		0x03
/** @defgroup tc0_cmr0_wave_eq_1_eevtedg EEVTEDG External Event Edge Selection
@{*/
/**@}*/

/** TC0_CMR0_WAVE_EQ_1_CPCDIS Counter Clock Disable with RC Compare **/
#define TC0_CMR0_WAVE_EQ_1_CPCDIS		(1 << 7)
/** TC0_CMR0_WAVE_EQ_1_CPCSTOP Counter Clock Stopped with RC Compare **/
#define TC0_CMR0_WAVE_EQ_1_CPCSTOP		(1 << 6)

#define TC0_CMR0_WAVE_EQ_1_BURST_SHIFT		4
#define TC0_CMR0_WAVE_EQ_1_BURST_MASK		0x03
/** @defgroup tc0_cmr0_wave_eq_1_burst BURST Burst Signal Selection
@{*/
/**@}*/

/** TC0_CMR0_WAVE_EQ_1_CLKI Clock Invert **/
#define TC0_CMR0_WAVE_EQ_1_CLKI		(1 << 3)

#define TC0_CMR0_WAVE_EQ_1_TCCLKS_SHIFT		0
#define TC0_CMR0_WAVE_EQ_1_TCCLKS_MASK		0x07
/** @defgroup tc0_cmr0_wave_eq_1_tcclks TCCLKS Clock Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_smmr0 SMMR0 Stepper Motor Mode Register (channel = 0)
@{*/

/** TC0_SMMR0_DOWN DOWN Count **/
#define TC0_SMMR0_DOWN		(1 << 1)
/** TC0_SMMR0_GCEN Gray Count Enable **/
#define TC0_SMMR0_GCEN		(1 << 0)

/**@}*/

/** @defgroup tc0_cv0 CV0 Counter Value (channel = 0)
@{*/


#define TC0_CV0_CV_SHIFT		0
#define TC0_CV0_CV_MASK		0xffffffff
/** @defgroup tc0_cv0_cv CV Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_ra0 RA0 Register A (channel = 0)
@{*/


#define TC0_RA0_RA_SHIFT		0
#define TC0_RA0_RA_MASK		0xffffffff
/** @defgroup tc0_ra0_ra RA Register A
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_rb0 RB0 Register B (channel = 0)
@{*/


#define TC0_RB0_RB_SHIFT		0
#define TC0_RB0_RB_MASK		0xffffffff
/** @defgroup tc0_rb0_rb RB Register B
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_rc0 RC0 Register C (channel = 0)
@{*/


#define TC0_RC0_RC_SHIFT		0
#define TC0_RC0_RC_MASK		0xffffffff
/** @defgroup tc0_rc0_rc RC Register C
@{*/
/**@}*/


/**@}*/

/** @defgroup tc0_sr0 SR0 Status Register (channel = 0)
@{*/

/** TC0_SR0_MTIOB TIOB Mirror **/
#define TC0_SR0_MTIOB		(1 << 18)
/** TC0_SR0_MTIOA TIOA Mirror **/
#define TC0_SR0_MTIOA		(1 << 17)
/** TC0_SR0_CLKSTA Clock Enabling Status **/
#define TC0_SR0_CLKSTA		(1 << 16)
/** TC0_SR0_ETRGS External Trigger Status **/
#define TC0_SR0_ETRGS		(1 << 7)
/** TC0_SR0_LDRBS RB Loading Status **/
#define TC0_SR0_LDRBS		(1 << 6)
/** TC0_SR0_LDRAS RA Loading Status **/
#define TC0_SR0_LDRAS		(1 << 5)
/** TC0_SR0_CPCS RC Compare Status **/
#define TC0_SR0_CPCS		(1 << 4)
/** TC0_SR0_CPBS RB Compare Status **/
#define TC0_SR0_CPBS		(1 << 3)
/** TC0_SR0_CPAS RA Compare Status **/
#define TC0_SR0_CPAS		(1 << 2)
/** TC0_SR0_LOVRS Load Overrun Status **/
#define TC0_SR0_LOVRS		(1 << 1)
/** TC0_SR0_COVFS Counter Overflow Status **/
#define TC0_SR0_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc0_ier0 IER0 Interrupt Enable Register (channel = 0)
@{*/

/** TC0_IER0_ETRGS External Trigger **/
#define TC0_IER0_ETRGS		(1 << 7)
/** TC0_IER0_LDRBS RB Loading **/
#define TC0_IER0_LDRBS		(1 << 6)
/** TC0_IER0_LDRAS RA Loading **/
#define TC0_IER0_LDRAS		(1 << 5)
/** TC0_IER0_CPCS RC Compare **/
#define TC0_IER0_CPCS		(1 << 4)
/** TC0_IER0_CPBS RB Compare **/
#define TC0_IER0_CPBS		(1 << 3)
/** TC0_IER0_CPAS RA Compare **/
#define TC0_IER0_CPAS		(1 << 2)
/** TC0_IER0_LOVRS Load Overrun **/
#define TC0_IER0_LOVRS		(1 << 1)
/** TC0_IER0_COVFS Counter Overflow **/
#define TC0_IER0_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc0_idr0 IDR0 Interrupt Disable Register (channel = 0)
@{*/

/** TC0_IDR0_ETRGS External Trigger **/
#define TC0_IDR0_ETRGS		(1 << 7)
/** TC0_IDR0_LDRBS RB Loading **/
#define TC0_IDR0_LDRBS		(1 << 6)
/** TC0_IDR0_LDRAS RA Loading **/
#define TC0_IDR0_LDRAS		(1 << 5)
/** TC0_IDR0_CPCS RC Compare **/
#define TC0_IDR0_CPCS		(1 << 4)
/** TC0_IDR0_CPBS RB Compare **/
#define TC0_IDR0_CPBS		(1 << 3)
/** TC0_IDR0_CPAS RA Compare **/
#define TC0_IDR0_CPAS		(1 << 2)
/** TC0_IDR0_LOVRS Load Overrun **/
#define TC0_IDR0_LOVRS		(1 << 1)
/** TC0_IDR0_COVFS Counter Overflow **/
#define TC0_IDR0_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc0_imr0 IMR0 Interrupt Mask Register (channel = 0)
@{*/

/** TC0_IMR0_ETRGS External Trigger **/
#define TC0_IMR0_ETRGS		(1 << 7)
/** TC0_IMR0_LDRBS RB Loading **/
#define TC0_IMR0_LDRBS		(1 << 6)
/** TC0_IMR0_LDRAS RA Loading **/
#define TC0_IMR0_LDRAS		(1 << 5)
/** TC0_IMR0_CPCS RC Compare **/
#define TC0_IMR0_CPCS		(1 << 4)
/** TC0_IMR0_CPBS RB Compare **/
#define TC0_IMR0_CPBS		(1 << 3)
/** TC0_IMR0_CPAS RA Compare **/
#define TC0_IMR0_CPAS		(1 << 2)
/** TC0_IMR0_LOVRS Load Overrun **/
#define TC0_IMR0_LOVRS		(1 << 1)
/** TC0_IMR0_COVFS Counter Overflow **/
#define TC0_IMR0_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc0_ccr1 CCR1 Channel Control Register (channel = 1)
@{*/

/** TC0_CCR1_SWTRG Software Trigger Command **/
#define TC0_CCR1_SWTRG		(1 << 2)
/** TC0_CCR1_CLKDIS Counter Clock Disable Command **/
#define TC0_CCR1_CLKDIS		(1 << 1)
/** TC0_CCR1_CLKEN Counter Clock Enable Command **/
#define TC0_CCR1_CLKEN		(1 << 0)

/**@}*/

/** @defgroup tc0_cmr1 CMR1 Channel Mode Register (channel = 1)
@{*/


#define TC0_CMR1_LDRB_SHIFT		18
#define TC0_CMR1_LDRB_MASK		0x03
/** @defgroup tc0_cmr1_ldrb LDRB RB Loading Edge Selection
@{*/
/**@}*/


#define TC0_CMR1_LDRA_SHIFT		16
#define TC0_CMR1_LDRA_MASK		0x03
/** @defgroup tc0_cmr1_ldra LDRA RA Loading Edge Selection
@{*/
/**@}*/

/** TC0_CMR1_WAVE Waveform Mode **/
#define TC0_CMR1_WAVE		(1 << 15)
/** TC0_CMR1_CPCTRG RC Compare Trigger Enable **/
#define TC0_CMR1_CPCTRG		(1 << 14)
/** TC0_CMR1_ABETRG TIOA or TIOB External Trigger Selection **/
#define TC0_CMR1_ABETRG		(1 << 10)

#define TC0_CMR1_ETRGEDG_SHIFT		8
#define TC0_CMR1_ETRGEDG_MASK		0x03
/** @defgroup tc0_cmr1_etrgedg ETRGEDG External Trigger Edge Selection
@{*/
/**@}*/

/** TC0_CMR1_LDBDIS Counter Clock Disable with RB Loading **/
#define TC0_CMR1_LDBDIS		(1 << 7)
/** TC0_CMR1_LDBSTOP Counter Clock Stopped with RB Loading **/
#define TC0_CMR1_LDBSTOP		(1 << 6)

#define TC0_CMR1_BURST_SHIFT		4
#define TC0_CMR1_BURST_MASK		0x03
/** @defgroup tc0_cmr1_burst BURST Burst Signal Selection
@{*/
/**@}*/

/** TC0_CMR1_CLKI Clock Invert **/
#define TC0_CMR1_CLKI		(1 << 3)

#define TC0_CMR1_TCCLKS_SHIFT		0
#define TC0_CMR1_TCCLKS_MASK		0x07
/** @defgroup tc0_cmr1_tcclks TCCLKS Clock Selection
@{*/
/**@}*/


/**@}*/

